benchmark/results/throughput_mc-vs-rust/RAW/hyper-plaintext-throughput_mc-cal-218702.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.86ms    1.85ms  20.96ms   92.49%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.42ms
 75.000%    1.93ms
 90.000%    2.91ms
 99.000%   10.87ms
 99.900%   16.35ms
 99.990%   19.41ms
 99.999%   20.48ms
100.000%   20.98ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.021     0.000000            1         1.00
       0.698     0.100000       215146         1.11
       0.906     0.200000       428962         1.25
       1.080     0.300000       644323         1.43
       1.251     0.400000       858235         1.67
       1.423     0.500000      1072807         2.00
       1.511     0.550000      1180403         2.22
       1.601     0.600000      1286837         2.50
       1.698     0.650000      1394398         2.86
       1.805     0.700000      1501772         3.33
       1.928     0.750000      1608609         4.00
       2.000     0.775000      1662315         4.44
       2.081     0.800000      1716015         5.00
       2.177     0.825000      1769337         5.71
       2.321     0.850000      1823041         6.67
       2.535     0.875000      1876656         8.00
       2.689     0.887500      1903224         8.89
       2.907     0.900000      1930043        10.00
       3.233     0.912500      1956722        11.43
       3.715     0.925000      1983540        13.33
       4.395     0.937500      2010406        16.00
       4.815     0.943750      2023704        17.78
       5.291     0.950000      2037137        20.00
       5.831     0.956250      2050605        22.86
       6.439     0.962500      2063939        26.67
       7.151     0.968750      2077330        32.00
       7.539     0.971875      2084066        35.56
       7.923     0.975000      2090748        40.00
       8.359     0.978125      2097438        45.71
       8.871     0.981250      2104119        53.33
       9.487     0.984375      2110868        64.00
       9.815     0.985938      2114173        71.11
      10.191     0.987500      2117515        80.00
      10.599     0.989062      2120908        91.43
      11.055     0.990625      2124240       106.67
      11.559     0.992188      2127607       128.00
      11.831     0.992969      2129248       142.22
      12.127     0.993750      2130920       160.00
      12.463     0.994531      2132610       182.86
      12.839     0.995313      2134280       213.33
      13.271     0.996094      2135940       256.00
      13.519     0.996484      2136778       284.44
      13.807     0.996875      2137627       320.00
      14.111     0.997266      2138468       365.71
      14.471     0.997656      2139310       426.67
      14.927     0.998047      2140133       512.00
      15.175     0.998242      2140548       568.89
      15.439     0.998437      2140968       640.00
      15.727     0.998633      2141394       731.43
      16.047     0.998828      2141811       853.33
      16.399     0.999023      2142232      1024.00
      16.575     0.999121      2142439      1137.78
      16.799     0.999219      2142655      1280.00
      17.055     0.999316      2142864      1462.86
      17.311     0.999414      2143061      1706.67
      17.631     0.999512      2143278      2048.00
      17.791     0.999561      2143378      2275.56
      17.951     0.999609      2143480      2560.00
      18.143     0.999658      2143587      2925.71
      18.351     0.999707      2143699      3413.33
      18.575     0.999756      2143796      4096.00
      18.735     0.999780      2143850      4551.11
      18.863     0.999805      2143902      5120.00
      18.975     0.999829      2143953      5851.43
      19.119     0.999854      2144006      6826.67
      19.295     0.999878      2144058      8192.00
      19.359     0.999890      2144082      9102.22
      19.423     0.999902      2144107     10240.00
      19.519     0.999915      2144134     11702.86
      19.663     0.999927      2144160     13653.33
      19.807     0.999939      2144187     16384.00
      19.855     0.999945      2144201     18204.44
      19.919     0.999951      2144215     20480.00
      19.951     0.999957      2144226     23405.71
      19.983     0.999963      2144238     27306.67
      20.095     0.999969      2144252     32768.00
      20.127     0.999973      2144258     36408.89
      20.175     0.999976      2144266     40960.00
      20.239     0.999979      2144274     46811.43
      20.271     0.999982      2144280     54613.33
      20.367     0.999985      2144284     65536.00
      20.399     0.999986      2144288     72817.78
      20.447     0.999988      2144290     81920.00
      20.479     0.999989      2144295     93622.86
      20.527     0.999991      2144298    109226.67
      20.543     0.999992      2144300    131072.00
      20.623     0.999993      2144303    145635.56
      20.623     0.999994      2144303    163840.00
      20.687     0.999995      2144305    187245.71
      20.719     0.999995      2144307    218453.33
      20.735     0.999996      2144308    262144.00
      20.751     0.999997      2144310    291271.11
      20.751     0.999997      2144310    327680.00
      20.767     0.999997      2144311    374491.43
      20.783     0.999998      2144312    436906.67
      20.783     0.999998      2144312    524288.00
      20.879     0.999998      2144313    582542.22
      20.879     0.999998      2144313    655360.00
      20.911     0.999999      2144314    748982.86
      20.911     0.999999      2144314    873813.33
      20.911     0.999999      2144314   1048576.00
      20.927     0.999999      2144315   1165084.44
      20.927     0.999999      2144315   1310720.00
      20.927     0.999999      2144315   1497965.71
      20.927     0.999999      2144315   1747626.67
      20.927     1.000000      2144315   2097152.00
      20.975     1.000000      2144316   2330168.89
      20.975     1.000000      2144316          inf
#[Mean    =        1.860, StdDeviation   =        1.851]
#[Max     =       20.960, Total count    =      2144316]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2144328 requests in 10.00s, 265.85MB read
Requests/sec: 214445.50
Transfer/sec:     26.59MB