benchmark/results/throughput_mc-vs-rust/RAW/hyper-plaintext-throughput_mc-run1.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.277ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.273ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.270ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.296ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.271ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.267ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27ms  607.25us  22.53ms   70.27%
    Req/Sec    25.99k     1.81k   49.11k    74.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.64ms
 90.000%    2.03ms
 99.000%    2.80ms
 99.900%    3.30ms
 99.990%   14.13ms
 99.999%   21.07ms
100.000%   22.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.033     0.000000            1         1.00
       0.562     0.100000       390567         1.11
       0.742     0.200000       782372         1.25
       0.901     0.300000      1171863         1.43
       1.070     0.400000      1564249         1.67
       1.232     0.500000      1953208         2.00
       1.311     0.550000      2148381         2.22
       1.391     0.600000      2345488         2.50
       1.470     0.650000      2539039         2.86
       1.552     0.700000      2733818         3.33
       1.640     0.750000      2929425         4.00
       1.688     0.775000      3027667         4.44
       1.739     0.800000      3124270         5.00
       1.796     0.825000      3221817         5.71
       1.861     0.850000      3319306         6.67
       1.936     0.875000      3417311         8.00
       1.980     0.887500      3466260         8.89
       2.030     0.900000      3515024        10.00
       2.087     0.912500      3565056        11.43
       2.149     0.925000      3613602        13.33
       2.223     0.937500      3661639        16.00
       2.265     0.943750      3685468        17.78
       2.313     0.950000      3710629        20.00
       2.363     0.956250      3734672        22.86
       2.419     0.962500      3759259        26.67
       2.481     0.968750      3783589        32.00
       2.515     0.971875      3795523        35.56
       2.553     0.975000      3807932        40.00
       2.593     0.978125      3820031        45.71
       2.637     0.981250      3831900        53.33
       2.689     0.984375      3844468        64.00
       2.717     0.985938      3850544        71.11
       2.747     0.987500      3856536        80.00
       2.781     0.989062      3862606        91.43
       2.819     0.990625      3868722       106.67
       2.861     0.992188      3874656       128.00
       2.885     0.992969      3877621       142.22
       2.913     0.993750      3880771       160.00
       2.943     0.994531      3883746       182.86
       2.977     0.995313      3886772       213.33
       3.015     0.996094      3889835       256.00
       3.037     0.996484      3891354       284.44
       3.061     0.996875      3892909       320.00
       3.087     0.997266      3894433       365.71
       3.115     0.997656      3895923       426.67
       3.149     0.998047      3897486       512.00
       3.171     0.998242      3898239       568.89
       3.197     0.998437      3899015       640.00
       3.227     0.998633      3899742       731.43
       3.263     0.998828      3900511       853.33
       3.309     0.999023      3901260      1024.00
       3.339     0.999121      3901657      1137.78
       3.375     0.999219      3902028      1280.00
       3.417     0.999316      3902397      1462.86
       3.467     0.999414      3902781      1706.67
       3.545     0.999512      3903159      2048.00
       3.603     0.999561      3903352      2275.56
       3.689     0.999609      3903544      2560.00
       3.837     0.999658      3903732      2925.71
       4.927     0.999707      3903921      3413.33
       6.691     0.999756      3904112      4096.00
       7.507     0.999780      3904207      4551.11
       8.295     0.999805      3904303      5120.00
       9.207     0.999829      3904399      5851.43
      10.759     0.999854      3904493      6826.67
      12.503     0.999878      3904589      8192.00
      13.399     0.999890      3904636      9102.22
      14.335     0.999902      3904685     10240.00
      15.183     0.999915      3904732     11702.86
      16.127     0.999927      3904779     13653.33
      16.959     0.999939      3904828     16384.00
      17.407     0.999945      3904852     18204.44
      17.871     0.999951      3904875     20480.00
      18.335     0.999957      3904899     23405.71
      18.895     0.999963      3904922     27306.67
      19.391     0.999969      3904946     32768.00
      19.583     0.999973      3904958     36408.89
      19.855     0.999976      3904970     40960.00
      20.063     0.999979      3904982     46811.43
      20.303     0.999982      3904995     54613.33
      20.591     0.999985      3905007     65536.00
      20.703     0.999986      3905012     72817.78
      20.847     0.999988      3905018     81920.00
      20.959     0.999989      3905024     93622.86
      21.183     0.999991      3905030    109226.67
      21.407     0.999992      3905036    131072.00
      21.487     0.999993      3905039    145635.56
      21.519     0.999994      3905042    163840.00
      21.599     0.999995      3905045    187245.71
      21.679     0.999995      3905048    218453.33
      21.727     0.999996      3905051    262144.00
      21.743     0.999997      3905052    291271.11
      21.807     0.999997      3905054    327680.00
      21.823     0.999997      3905055    374491.43
      21.903     0.999998      3905057    436906.67
      21.999     0.999998      3905058    524288.00
      22.095     0.999998      3905059    582542.22
      22.159     0.999998      3905060    655360.00
      22.159     0.999999      3905060    748982.86
      22.223     0.999999      3905061    873813.33
      22.351     0.999999      3905062   1048576.00
      22.351     0.999999      3905062   1165084.44
      22.367     0.999999      3905063   1310720.00
      22.367     0.999999      3905063   1497965.71
      22.367     0.999999      3905063   1747626.67
      22.383     1.000000      3905064   2097152.00
      22.383     1.000000      3905064   2330168.89
      22.383     1.000000      3905064   2621440.00
      22.383     1.000000      3905064   2995931.43
      22.383     1.000000      3905064   3495253.33
      22.543     1.000000      3905065   4194304.00
      22.543     1.000000      3905065          inf
#[Mean    =        1.274, StdDeviation   =        0.607]
#[Max     =       22.528, Total count    =      3905065]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5843674 requests in 30.00s, 724.49MB read
Requests/sec: 194793.78
Transfer/sec:     24.15MB